results/wrk2/plaintextget.txt
09:49:03 {play-2.6-with-netty} ~/Projects/com/github/plokhotnyuk/play$ ./wrk -c50 -d1m -t2 -R41500 -L -v http://localhost:9000/plaintext
wrk 4.0.0 [epoll] Copyright (C) 2012 Will Glozer
Running 1m test @ http://localhost:9000/plaintext
  2 threads and 50 connections
  Thread calibration: mean lat.: 1.419ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.426ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.90ms    2.00ms  24.85ms   94.15%
    Req/Sec    21.84k     1.63k   35.00k    71.75%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.47ms
 75.000%    2.02ms
 90.000%    2.91ms
 99.000%   11.91ms
 99.900%   21.85ms
 99.990%   23.47ms
 99.999%   24.06ms
100.000%   24.86ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.063     0.000000            1         1.00
       0.722     0.100000       206993         1.11
       0.951     0.200000       414771         1.25
       1.137     0.300000       621647         1.43
       1.305     0.400000       828091         1.67
       1.474     0.500000      1035016         2.00
       1.562     0.550000      1139152         2.22
       1.655     0.600000      1242827         2.50
       1.756     0.650000      1345762         2.86
       1.872     0.700000      1449149         3.33
       2.017     0.750000      1552445         4.00
       2.107     0.775000      1604648         4.44
       2.211     0.800000      1655984         5.00
       2.335     0.825000      1708218         5.71
       2.479     0.850000      1759331         6.67
       2.661     0.875000      1811431         8.00
       2.773     0.887500      1837160         8.89
       2.911     0.900000      1862896        10.00
       3.099     0.912500      1888690        11.43
       3.359     0.925000      1914564        13.33
       3.739     0.937500      1940514        16.00
       4.009     0.943750      1953439        17.78
       4.343     0.950000      1966354        20.00
       4.787     0.956250      1979294        22.86
       5.375     0.962500      1992241        26.67
       6.179     0.968750      2005167        32.00
       6.687     0.971875      2011586        35.56
       7.271     0.975000      2018068        40.00
       7.927     0.978125      2024522        45.71
       8.751     0.981250      2031025        53.33
       9.775     0.984375      2037479        64.00
      10.319     0.985938      2040714        71.11
      10.863     0.987500      2043966        80.00
      11.503     0.989062      2047184        91.43
      12.167     0.990625      2050429       106.67
      12.799     0.992188      2053634       128.00
      13.223     0.992969      2055243       142.22
      13.743     0.993750      2056878       160.00
      14.479     0.994531      2058489       182.86
      15.687     0.995313      2060097       213.33
      16.847     0.996094      2061732       256.00
      17.439     0.996484      2062539       284.44
      18.063     0.996875      2063328       320.00
      18.735     0.997266      2064137       365.71
      19.551     0.997656      2064948       426.67
      20.303     0.998047      2065769       512.00
      20.639     0.998242      2066166       568.89
      20.959     0.998437      2066568       640.00
      21.279     0.998633      2066969       731.43
      21.599     0.998828      2067389       853.33
      21.903     0.999023      2067787      1024.00
      22.063     0.999121      2067981      1137.78
      22.223     0.999219      2068180      1280.00
      22.383     0.999316      2068395      1462.86
      22.543     0.999414      2068594      1706.67
      22.687     0.999512      2068793      2048.00
      22.767     0.999561      2068900      2275.56
      22.847     0.999609      2068995      2560.00
      22.927     0.999658      2069095      2925.71
      23.023     0.999707      2069199      3413.33
      23.103     0.999756      2069294      4096.00
      23.151     0.999780      2069343      4551.11
      23.199     0.999805      2069393      5120.00
      23.263     0.999829      2069454      5851.43
      23.311     0.999854      2069494      6826.67
      23.375     0.999878      2069545      8192.00
      23.423     0.999890      2069572      9102.22
      23.471     0.999902      2069596     10240.00
      23.519     0.999915      2069624     11702.86
      23.551     0.999927      2069646     13653.33
      23.615     0.999939      2069673     16384.00
      23.647     0.999945      2069685     18204.44
      23.679     0.999951      2069697     20480.00
      23.711     0.999957      2069715     23405.71
      23.743     0.999963      2069722     27306.67
      23.807     0.999969      2069735     32768.00
      23.823     0.999973      2069745     36408.89
      23.839     0.999976      2069747     40960.00
      23.871     0.999979      2069755     46811.43
      23.887     0.999982      2069759     54613.33
      23.967     0.999985      2069765     65536.00
      23.999     0.999986      2069768     72817.78
      24.015     0.999988      2069771     81920.00
      24.047     0.999989      2069774     93622.86
      24.063     0.999991      2069778    109226.67
      24.095     0.999992      2069781    131072.00
      24.111     0.999993      2069782    145635.56
      24.159     0.999994      2069785    163840.00
      24.159     0.999995      2069785    187245.71
      24.191     0.999995      2069787    218453.33
      24.239     0.999996      2069789    262144.00
      24.239     0.999997      2069789    291271.11
      24.255     0.999997      2069790    327680.00
      24.287     0.999997      2069791    374491.43
      24.303     0.999998      2069792    436906.67
      24.351     0.999998      2069793    524288.00
      24.351     0.999998      2069793    582542.22
      24.351     0.999998      2069793    655360.00
      24.463     0.999999      2069794    748982.86
      24.463     0.999999      2069794    873813.33
      24.495     0.999999      2069795   1048576.00
      24.495     0.999999      2069795   1165084.44
      24.495     0.999999      2069795   1310720.00
      24.495     0.999999      2069795   1497965.71
      24.495     0.999999      2069795   1747626.67
      24.863     1.000000      2069796   2097152.00
      24.863     1.000000      2069796          inf
#[Mean    =        1.900, StdDeviation   =        1.998]
#[Max     =       24.848, Total count    =      2069796]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2487456 requests in 1.00m, 308.39MB read
Requests/sec:  41457.59
Transfer/sec:      5.14MB