results/wrk2/plaintextget.txt
02:03:51 {master} ~/Projects/com/github/plokhotnyuk/play$ wrk -c50 -d2m -t2 -R65000 -L -v http://localhost:9000/plaintext
wrk 4.0.0 [epoll] Copyright (C) 2012 Will Glozer
Running 2m test @ http://localhost:9000/plaintext
  2 threads and 50 connections
  Thread calibration: mean lat.: 1.481ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.700ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.38ms    1.08ms  26.16ms   93.54%
    Req/Sec    34.30k     2.74k   48.67k    73.58%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.20ms
 75.000%    1.66ms
 90.000%    2.14ms
 99.000%    5.37ms
 99.900%   14.50ms
 99.990%   23.50ms
 99.999%   24.98ms
100.000%   26.17ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.038     0.000000            1         1.00
       0.601     0.100000       716804         1.11
       0.770     0.200000      1429501         1.25
       0.914     0.300000      2143242         1.43
       1.056     0.400000      2859622         1.67
       1.202     0.500000      3573212         2.00
       1.279     0.550000      3928811         2.22
       1.361     0.600000      4287259         2.50
       1.449     0.650000      4644040         2.86
       1.546     0.700000      5001219         3.33
       1.656     0.750000      5358088         4.00
       1.717     0.775000      5534993         4.44
       1.784     0.800000      5714278         5.00
       1.858     0.825000      5893764         5.71
       1.939     0.850000      6071032         6.67
       2.032     0.875000      6250571         8.00
       2.085     0.887500      6341455         8.89
       2.141     0.900000      6428488        10.00
       2.205     0.912500      6517303        11.43
       2.281     0.925000      6607741        13.33
       2.373     0.937500      6696999        16.00
       2.429     0.943750      6741009        17.78
       2.497     0.950000      6785425        20.00
       2.585     0.956250      6830083        22.86
       2.705     0.962500      6874256        26.67
       2.899     0.968750      6918864        32.00
       3.047     0.971875      6941151        35.56
       3.251     0.975000      6963363        40.00
       3.529     0.978125      6985599        45.71
       3.877     0.981250      7007926        53.33
       4.295     0.984375      7030257        64.00
       4.543     0.985938      7041380        71.11
       4.823     0.987500      7052526        80.00
       5.143     0.989062      7063666        91.43
       5.535     0.990625      7074864       106.67
       6.055     0.992188      7086036       128.00
       6.399     0.992969      7091579       142.22
       6.811     0.993750      7097172       160.00
       7.279     0.994531      7102741       182.86
       7.815     0.995313      7108335       213.33
       8.415     0.996094      7113950       256.00
       8.735     0.996484      7116688       284.44
       9.079     0.996875      7119479       320.00
       9.511     0.997266      7122286       365.71
      10.047     0.997656      7125046       426.67
      10.863     0.998047      7127844       512.00
      11.423     0.998242      7129220       568.89
      12.103     0.998437      7130620       640.00
      12.807     0.998633      7132021       731.43
      13.583     0.998828      7133407       853.33
      14.647     0.999023      7134806      1024.00
      15.279     0.999121      7135498      1137.78
      16.007     0.999219      7136195      1280.00
      16.847     0.999316      7136893      1462.86
      17.823     0.999414      7137596      1706.67
      18.863     0.999512      7138293      2048.00
      19.375     0.999561      7138646      2275.56
      19.903     0.999609      7138989      2560.00
      20.479     0.999658      7139334      2925.71
      21.071     0.999707      7139685      3413.33
      21.647     0.999756      7140031      4096.00
      21.967     0.999780      7140206      4551.11
      22.271     0.999805      7140380      5120.00
      22.655     0.999829      7140555      5851.43
      22.959     0.999854      7140734      6826.67
      23.247     0.999878      7140906      8192.00
      23.407     0.999890      7140995      9102.22
      23.535     0.999902      7141076     10240.00
      23.679     0.999915      7141166     11702.86
      23.839     0.999927      7141258     13653.33
      23.983     0.999939      7141339     16384.00
      24.063     0.999945      7141388     18204.44
      24.159     0.999951      7141426     20480.00
      24.255     0.999957      7141472     23405.71
      24.351     0.999963      7141515     27306.67
      24.447     0.999969      7141558     32768.00
      24.527     0.999973      7141581     36408.89
      24.575     0.999976      7141600     40960.00
      24.655     0.999979      7141622     46811.43
      24.719     0.999982      7141644     54613.33
      24.815     0.999985      7141668     65536.00
      24.863     0.999986      7141676     72817.78
      24.895     0.999988      7141687     81920.00
      24.959     0.999989      7141701     93622.86
      25.023     0.999991      7141711    109226.67
      25.087     0.999992      7141719    131072.00
      25.135     0.999993      7141726    145635.56
      25.167     0.999994      7141730    163840.00
      25.183     0.999995      7141735    187245.71
      25.263     0.999995      7141741    218453.33
      25.327     0.999996      7141746    262144.00
      25.391     0.999997      7141750    291271.11
      25.455     0.999997      7141755    327680.00
      25.455     0.999997      7141755    374491.43
      25.535     0.999998      7141758    436906.67
      25.631     0.999998      7141760    524288.00
      25.663     0.999998      7141761    582542.22
      25.759     0.999998      7141764    655360.00
      25.759     0.999999      7141764    748982.86
      25.775     0.999999      7141765    873813.33
      25.823     0.999999      7141767   1048576.00
      25.823     0.999999      7141767   1165084.44
      25.871     0.999999      7141768   1310720.00
      25.887     0.999999      7141769   1497965.71
      25.887     0.999999      7141769   1747626.67
      25.903     1.000000      7141771   2097152.00
      25.903     1.000000      7141771   2330168.89
      25.903     1.000000      7141771   2621440.00
      25.903     1.000000      7141771   2995931.43
      25.903     1.000000      7141771   3495253.33
      25.967     1.000000      7141772   4194304.00
      25.967     1.000000      7141772   4660337.78
      25.967     1.000000      7141772   5242880.00
      25.967     1.000000      7141772   5991862.86
      25.967     1.000000      7141772   6990506.67
      26.175     1.000000      7141773   8388608.00
      26.175     1.000000      7141773          inf
#[Mean    =        1.378, StdDeviation   =        1.084]
#[Max     =       26.160, Total count    =      7141773]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7795951 requests in 2.00m, 0.94GB read
Requests/sec:  64966.28
Transfer/sec:      8.05MB